Revit 2027 API
ExportFontTable.ContainsKey Method
 Checks whether a font key exists in the table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ContainsKey(
	ExportFontKey exportfontKey
)
Public Function ContainsKey (
	exportfontKey As ExportFontKey
) As Boolean
public:
bool ContainsKey(
	ExportFontKey^ exportfontKey
)
member ContainsKey :
        exportfontKey : ExportFontKey -> bool
Parameters
exportfontKey ExportFontKey
 The export font Key.
Return Value
Boolean
 True if the font key exists in the table.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportFontTable Class
Autodesk.Revit.DB Namespace